#lang racket

(require "dagc.rkt")

(define (unknown-says sth) (say "？？？" sth))

; 安去去（Anqur），本作男主角，火箭工程师，猛犸（Mamooth）火箭引擎的最终设计者
(define (me-says sth) (say "Anqur" sth))
; 凌筱竹，可选的女主角，安去去的师妹
(define (lxz-says sth) (say "凌筱竹" sth))
; 萧雨菲，凌筱竹的舍友，安去去的中学同学
(define (xyf-says sth) (say "萧雨菲" sth))
; 流云坠海（Lyzh），网络安全工程师，酒精差分机（AlcoholDiff）反间谍系统的编写者，安去去的死党
(define (lyzh-says sth) (say "Lyzh" sth))
; 锤哥（Chuigda），精神控制能力者，休伯利安（Hyperion）系统的建设者，安去去的死党
(define (chui-says sth) (say "Chuigda" sth))

(define anququ-reborn
  (build-game 
    "重生实验室之安去去太强：偏二甲肼"
    "ICEY <icey@icey.tech>"
    'CC0
    '("重生" "无敌流" "安去去")
    (string-append "他累死累活，在科研领域作出顶级贡献，成果却被导师和师兄窃取。"
                   "因为常年劳累，他最终悲愤交加，病倒在工作台上！他仇恨，他不甘，"
                   "这一世，荣华富贵靠自己，我命由我不由天！")
    (scenes (scene 1 (list (unknown-says "师兄，快醒醒")
                           (me-says "唔... 我这是...")
                           (unknown-says "师兄，你的实验结果跑出来了")
                           (me-says "嗯，好...")
                           "抬起沉重的脑袋，下意识地看了下时间"
                           (me-says "今天是一月四日！？")
                           "我这是，重生了！？"
                           (unknown-says "是啊师兄，离 DDL 还有三天，快一起加油吧！")
                           "凌筱竹师妹的声音一直是这么温柔体贴，充满正能量"
                           "如果师妹对自己的感情是真的就好了..."
                           "上一世，就是这个平时对自己温柔体贴的师妹，被导师安排在身边"
                           "像一个间谍一样，窃取自己的研究进度"
                           (me-says "嗯...")
                           "... 那么，这一次，我会让你们知道，欺侮我的代价！"
                           (me-says "好的，（假装在看数据），那么我去把系统完善一下，你先去休息吧")
                           (lxz-says "诶？今天不用我帮忙调试了吗？")
                           (me-says "嗯，不用了，大致的优化思路我已经有了")
                           (lxz-says "可是 DDL 的话...")
                           "要怎么做呢")
                     (choices (choice "让师妹帮忙"   2)
                              (choice "谢绝师妹帮忙" 3)))
            (scene 2 (list "要是断然拒绝的话，会被那个老毒物怀疑的吧... "
                           (me-says "那你就留下来吧")
                           (lxz-says "好哒，我去给师兄泡茶")
                           "那么，既然这样，我干脆...")
                     (choices (choice "磨洋工到下班" 4)
                              (choice "反向优化" 5)))
            (scene 3 (list "不行，接下来是研究的关键部分"
                           "无论如何这部分内容不能被窃取"
                           "否则上一世的悲剧又会重演了"
                           (me-says "不用担心，接下来的事情我有把握")
                           (lxz-says "这样啊，那好吧")
                           "师妹脸上一脸失望的表情"
                           (me-says "满纸荒唐言，一把辛酸泪。都云作者痴，谁解其中味...")
                           "看着师妹离开了实验室，不由得松了一口气"
                           (me-says "我最好确定一下实验室里有没有什么其他的间谍工具... ")
                           (me-says "对了！师妹有我电脑的密码，那么...")
                           "立刻重做了一遍系统，安装了两个操作系统到不同的分区，并且默认引导到第一个"
                           "然后把重要的研究进度保存到第二个系统里"
                           "并且使用 LVM 进行了加密"
                           (me-says "以防万一，在默认的那个系统里也保存一些不那么重要的数据")
                           (me-says "这样一来就可以保证重要的研发进度不被偷窃了，同时又不会引起怀疑")
                           (me-says "但是这毕竟只是缓兵之计，这篇论文对我的科研生涯非常重要")
                           (me-says "如何是好呢..."))
                     game-over)
            (scene 4 (list "那么，只要磨洋工到下班时间，就可以不用被窃取研发进度了吧"
                           "说着打开了 bilibili，开始看最近新上映的《科学一方通行》"
                           "; B站打钱！科方打钱！"
                           "..."
                           (lxz-says "啊学长，你怎么在摸鱼")
                           (me-says "偶尔休息一下嘛，这番做的真烂...")
                           "; 其实不打钱也没关系"
                           (lxz-says "还有三天就 DDL 了，学长你居然还有心思玩")
                           (me-says "三天打鱼两天晒网，休息是很重要的嘛...")
                           (lxz-says "那我也一起来看好咯")
                           "..."
                           "不知不觉就到了下班时间"
                           (me-says "下班了，回宿舍休息吧")
                           (lxz-says "可是... 可是研究进度的话...")
                           (me-says "没关系，有师兄我呢")
                           (lxz-says "那... 师兄不要太累哦")
                           "凌筱竹的身影消失在实验室门外"
                           "..."
                           "刚刚听到凌筱竹的声音，自己居然有些心痛"
                           "心痛自己过去一直生活在虚假和欺骗之中"
                           "心痛这样一个女孩子居然会成为导师的工具人"
                           (me-says "...嗯，没事的")
                           "也许，应该作出一些改变了")
                     (choices (choice "收集证据，向凌筱竹摊牌" 6)))
            (scene 5 (list "既然你这么喜欢窃取研发进度，那么我就把研发进度搞成负数！"
                           (me-says "（沉思...）")
                           "在记忆中搜索无数种可能的反向优化方案... "
                           "有了，就用这个吧"
                           (me-says "（假装计算...）")
                           (me-says "师妹，帮我把二氧化锰拿过来，化学纯的")
                           (lxz-says "来啦来啦")
                           "; note: 在Anqur所在的宇宙中，物理学和化学规则发生了一些改变"
                           "; 就当作是设定的一部分好了，反正重生已经不科学了"
                           "根据Anququ的知识，锰元素能在小规模、短时间试车时，提高肼的燃烧效率"
                           "显著增加等体积燃料的性能，并且降低环境污染"
                           "但是在更大的燃烧室和更长时间的燃烧中，由于锰元素密度比其他燃烧产物要大"
                           "因而不会随着其他产物排出，就会残留在燃烧室中，越积越多"
                           "这些锰元素，会以越来越快的速度促进燃料的燃烧，产生更高的室压..."
                           "反正老毒物根本不懂火箭科学，他也不会去做有关调查的吧"
                           (lxz-says "师兄，我拿来了~")
                           (me-says 
                             "（假装看了看标签，拿出计算器假装计算，并且拿出纸笔假装写下计算结果）")
                           "得多磨一点时间才行"
                           (me-says"啊，加 1.5 克到 1L 燃料里好了，用咱实验室那台 LV-30 试个车")
                           (lxz-says "这样真的没问题吗")
                           (me-says "没问题的，你还不信你师兄么？")
                           "师妹把二氧化锰加到燃料中，混合均匀之后倒进了实验室 LV-30 的燃料箱里"
                           "Anqur和师妹退回到观察间内"
                           (me-says "三，二，一，点火！")
                           "火焰从 LV-30 的喷口里喷射而出，在后面留下了七个马赫环"
                           (lxz-says "是七个马赫环啊！真没想到能做到这样的成果！")
                           (me-says "就是嘛，师兄的方案你还能不信？")
                           "测试结果出来了，平均比冲达到了惊人的 341s！"
                           (lxz-says "师兄好棒啊！")
                           (me-says "嗯，那差不多写论文吧")
                           (lxz-says "那我先回去咯")
                           (me-says "嗯，剩下的事情我差不多能一个人完成了")
                           "看着师妹的背影，Anqur 笑了笑")
                   game-over)
            (scene 6 (list "既然决定当面揭穿凌筱竹，就得先收集有关的信息"
                           "毕竟不可能告诉凌筱竹自己重生了，所以早就得知了她和导师的计划"
                           (me-says "我可以..."))
                   (choices (choice "检查计算机中的间谍软件" (lambda (game-env) 
                                                               (if (game-env 'get 'spyware)
                                                                   11
                                                                   (begin 
                                                                     (game-env 'set 'spyware true)
                                                                     7))))
                            (choice "调查凌筱竹的活动轨迹" (lambda (game-env)
                                                             (if (game-env 'get 'trace)
                                                                 11
                                                                 (begin 
                                                                   (game-env 'set 'trace true)
                                                                   8))))
                            (choice "询问凌筱竹的舍友" (lambda (game-env)
                                                         (if (game-env 'get 'roommate)
                                                           11
                                                           (begin (game-env 'set 'roommate true)
                                                                  9))))
                            (choice "结束调查" 10)))
            (scene 7 (list (me-says "凌筱竹有我电脑的启动密码，她有可能向电脑中植入了间谍软件")
                           "Anqur 打电话给 Lyzh"
                           "..."
                           (lyzh-says "呀安去去，好久不见，项目进展怎么样了")
                           (me-says "还是老样子，没啥改进。")
                           (me-says "对了，你的 AlcoholDiff 反间谍系统能不能借我用一下")
                           (lyzh-says "AlcoholDiff... 那东西还在开发，你要的话我马上给你送过去")
                           (me-says "那多谢了，改天请你吃饭")
                           "..."
                           "十分钟后，Lyzh 拿着一个U盘走进了 Anqur 的办公室"
                           (lyzh-says "你要的 AlcoholDiff，这可是最新试验型，对 99% 的间谍软件都有效")
                           (me-says "切，你就吹吧...")
                           (lyzh-says "说起来你怎么用得到这玩意，看片中病毒了？")
                           (me-says "才不是...")
                           (lyzh-says "好啦，插U盘重启...")
                           "AlcoholDiff 的图表显示在了电脑屏幕上"
                           "Lyzh 设定了扫描参数，输入了密钥，AlcoholDiff开始运行"
                           "..."
                           "..."
                           "“扫描结果：2个间谍软件，分别注入于 rundll32.exe 和 mspaint.exe 中”"
                           (lyzh-says "AlcoholDiff，显示二进制分析")
                           (string-append
                             "“Trojan 016335: 注入于 rundll32.exe 中，使用 Snappy 算法压缩自身，\n"
                             "利用 Windows 操作系统的某个远程过程调用漏洞提升自身权限，\n"
                             "并扫描主要工作目录，随后上传所有常见文档格式到 192.168.6.169”\n")
                           (string-append
                             "“Trojan 016336: 注入于 mspaint.exe 中，使用 Snappy 算法压缩自身，\n"
                             "在 mspaint.exe 启动后记录鼠标活动，在进程结束后利用 VMWare 更新服务，\n"
                             "上传记录数据到 192.168.6.169”")
                           (lyzh-says "192.168.6.169... 这是实验室的内部服务器之一啊")
                           (me-says "(故作惊讶)奇怪，难道实验室有内鬼...")
                           (lyzh-says "AlcoholDiff，借助已知漏洞，查询 192.168.6.169 十天之内的连入记录")
                           (me-says "想不到 AlcoholDiff 不但是反间谍软件，还是间谍软件啊")
                           "..."
                           "..."
                           "“服务器类型：Ubuntu 16.04.2 LTS, 64bit, Linux kernel 4.4.93”"
                           "“已使用 0326-2 远程代码执行漏洞入侵”"
                           "“十天内登录最多的用户是 lxz，常用终端为 LENOVO-PC-12F92C8X”"
                           (lyzh-says "凌筱竹... 她为什么要这么做，这真是...")
                           "Lyzh 攥紧了拳，恨地咬牙切齿"
                           (me-says "之后的事我自己会解决，老哥别跟她一般见识，消消气")
                           (lyzh-says "...嗯，老弟听我一句劝，千万别跟这种贱人客气")
                           (me-says "放心我自有分寸")
                           (string-append "Lyzh 把 AlcoholDiff 的分析报告存到本地，"
                                          "然后关掉了 AlcoholDiff，带着U盘走出了实验室")
                           "取得了“间谍软件”情报")
                   (choices (choice "调查完毕" 6)))
            (scene 8 (list (me-says "如果这几天凌筱竹的行动轨迹不同往常，那就能说明她有所计划")
                           "Anqur 打电话给 Chuigda"
                           "..."
                           (chui-says "死做活做像条狗，被人骂不能汪汪叫... 哎呀，大王幸肯临臣？")
                           (me-says "吾生竟与锤哥为伍！不闲聊了，我想借用一下 Hyperion 查点什么")
                           (chui-says "Hyperion？我说安去去，你不会是暗恋哪个小姑娘，想蹲她一手吧")
                           (me-says "是啊，我最近看上了我实验室凌筱竹小师妹，正好情人节快到了...")
                           (chui-says "屁，情人节还一个多月呢。不过嘛... 看在好基友的份上")
                           (me-says "怎么着")
                           (chui-says "(打开谷歌翻译，用谷歌的音调播放)叫爸爸")
                           (me-says "爸你个数码暴龙皮啊，gkd")
                           (chui-says "好，我这就用 Hyperion 分析的凌筱竹六个月以来的行动路线")
                           (me-says "原来 Hyperion 这么强大的么...")
                           (chui-says "开玩笑，我开发的系统，能不强大...")
                           (me-says "全部分析完成大概要多久")
                           (chui-says "十分钟，你先去喝杯咖啡吧")
                           "..."
                           "电话响了"
                           (chui-says "分析结果出来了")
                           (chui-says "分析显示，凌筱竹每天上午 6:00 - 6:30 之间离开宿舍")
                           (chui-says "周六通常是7:00之后才离开宿舍，大概和周五晚上熬夜有关")
                           (chui-says "吃完早饭之后就会去图书馆泡到中午 11:30 左右")
                           (chui-says "然后吃午饭，在这之后她习惯会宿舍打个盹，下午 3:00 才出门")
                           (chui-says "在实验室帮忙，实验室没事的时候就去自习室")
                           (chui-says "下午 6:30 左右吃晚饭，然后去操场散步到7:00")
                           (chui-says "之后再去实验室，9:00 再回宿舍")
                           (me-says "...嗯，这样啊")
                           (chui-says "不过，最近两周以来，她在吃晚饭之前都会去导师办公室转一圈")
                           (me-says "嗯，多谢锤哥了")
                           (chui-says "不用谢，这是当爸爸的应该做的")
                           "取得了“行动轨迹”情报")
                   (choices (choice "调查完毕" 6)))
            (scene 9 (list (me-says "凌筱竹的舍友应该知道一些有关的信息吧")
                           "打电话给萧雨菲"
                           ())
                   (choices (choice "调查完毕" 6)))
            (scene 10 (list (me-says "那么，调查到此为止，是时候摊牌了"))
                   game-over)
            (scene 11 "已经进行过这项调查了" (choices (choice "返回" 6)))
            )))

(play-game anququ-reborn)
