#lang racket

(require "dagc.rkt")

(define (unknown-says sth) (say "？？？" sth))
(define (lxz-says sth) (say "凌筱竹师妹" sth))
(define (me-says sth) (say "Anqur" sth))

(define anququ-reborn
  (build-game 
    "重生实验室之安去去太强：偏二甲肼"
    "ICEY <icey@icey.tech>"
    'CC0
    '("重生" "无敌流" "安去去")
    (string-append "他累死累活，在科研领域作出顶级贡献，成果却被导师和师兄窃取。"
                   "因为常年劳累，他最终悲愤交加，病倒在工作台上！他仇恨，他不甘，"
                   "这一世，荣华富贵靠自己，我命由我不由天！")
    (scenes (scene 1 (list (unknown-says "师兄，快醒醒")
                           (me-says "唔... 我这是...")
                           (unknown-says "师兄，你的实验结果跑出来了")
                           (me-says "嗯，好...")
                           "抬起沉重的脑袋，下意识地看了下时间"
                           (me-says "今天是一月四日！？")
                           "我这是，重生了！？"
                           (unknown-says "是啊师兄，离DDL还有三天，快一起加油吧！")
                           "凌筱竹师妹的声音一直是这么温柔体贴，充满正能量"
                           "如果师妹对自己的感情是真的就好了..."
                           "上一世，就是这个平时对自己温柔体贴的师妹，被导师安排在身边"
                           "像一个间谍一样，窃取自己的研究进度"
                           (me-says "嗯...")
                           "... 那么，这一次，我会让你们知道，欺侮我的代价！"
                           (me-says "好的，（假装在看数据），那么我去把系统完善一下，你先去休息吧")
                           (lxz-says "诶？今天不用我帮忙调试了吗？")
                           (me-says "嗯，不用了，大致的优化思路我已经有了")
                           (lxz-says "可是DDL的话...")
                           "要怎么做呢")
                     (choices (choice "让师妹帮忙"   2)
                              (choice "谢绝师妹帮忙" 3)))
            (scene 2 (list "要是断然拒绝的话，会被那个老毒物怀疑的吧... "
                           (me-says "那你就留下来吧")
                           (lxz-says "好哒，我去给师兄泡茶")
                           "那么，既然这样，我干脆...")
                     (choices (choice "磨洋工到下班" 4)
                              (choice "反向优化" 5)))
            (scene 3 (list "不行，接下来是研究的关键部分"
                           "无论如何这部分内容不能被窃取"
                           "否则上一世的悲剧又会重演了"
                           (me-says "不用担心，接下来的事情我有把握")
                           (lxz-says "这样啊，那好吧")
                           "师妹脸上一脸失望的表情"
                           (me-says "满纸荒唐言，一把辛酸泪。都云作者痴，谁解其中味...")
                           "看着师妹离开了实验室，不由得松了一口气"
                           (me-says "我最好确定一下实验室里有没有什么其他的间谍工具... ")
                           (me-says "对了！师妹有我电脑的密码，那么...")
                           "立刻重做了一遍系统，安装了两个操作系统到不同的分区，并且默认引导到第一个"
                           "然后把重要的研究进度保存到第二个系统里"
                           "并且使用LVM进行了加密"
                           (me-says "以防万一，在默认的那个系统里也保存一些不那么重要的数据")
                           (me-says "这样一来就可以保证重要的研发进度不被偷窃了，同时又不会引起怀疑")
                           (me-says "但是这毕竟只是缓兵之计，这篇论文对我的科研生涯非常重要")
                           (me-says "如何是好呢..."))
                     game-over)
            (scene 4 (list "那么，只要磨洋工到下班时间，就可以不用被窃取研发进度了吧"
                           "说着打开了 bilibili，开始看最近新上映的《科学一方通行》"
                           "; 科方打钱！"
                           "..."
                           (lxz-says "啊学长，你怎么在摸鱼")
                           (me-says "偶尔休息一下嘛，这番做的真烂...")
                           "; 好了可以不用打钱了"
                           (lxz-says "还有三天就DDL了，学长你居然还有心思玩")
                           (me-says "三天打鱼两天晒网，休息是很重要的嘛...")
                           (lxz-says "那我也一起来看好咯")
                           "..."
                           "不知不觉就到了下班时间"
                           (me-says "下班了，会宿舍休息吧")
                           (lxz-says "可是... 可是研究进度的话...")
                           (me-says "没关系，有师兄我呢")
                           (lxz-says "那... 师兄不要太累哦")
                           "听到凌筱竹的声音，自己居然有些心痛"
                           "心痛自己过去一直生活在虚假和欺骗之中"
                           "心痛这样一个女孩子居然会成为导师的工具人"
                           (me-says "...嗯，没事的"))
                     game-over)
            (scene 5 (list "既然你这么喜欢窃取研发进度，那么我就把研发进度搞成负数！"
                           (me-says "（沉思...）")
                           "在记忆中搜索无数种可能的反向优化方案... "
                           "有了，就用这个吧"
                           (me-says "（假装计算...）")
                           (me-says "师妹，帮我把二氧化锰拿过来，化学纯的")
                           (lxz-says "来啦来啦")
                           "; note: 在Anqur所在的宇宙中，物理学和化学规则发生了一些改变"
                           "; 就当作是设定的一部分好了，反正重生已经不科学了"
                           "根据Anququ的知识，锰元素能在小规模、短时间试车时，提高肼的燃烧效率"
                           "显著增加等体积燃料的性能，并且降低环境污染"
                           "但是在更大的燃烧室和更长时间的燃烧中，由于锰元素密度比其他燃烧产物要大"
                           "因而不会随着其他产物排出，就会残留在燃烧室中，越积越多"
                           "这些锰元素，会以越来越快的速度促进燃料的燃烧，产生更高的室压..."
                           "反正老毒物根本不懂火箭科学，他也不会去做有关调查的吧"
                           (lxz-says "师兄，我拿来了~")
                           (me-says 
                             "（假装看了看标签，拿出计算器假装计算，并且拿出纸笔假装写下计算结果）")
                           "得多磨一点时间才行"
                           (me-says"啊，加 1.5 克到 1L 燃料里好了，用咱实验室那台 LV-30 试个车")
                           (lxz-says "这样真的没问题吗")
                           (me-says "没问题的，你还不信你师兄么？")
                           "师妹把二氧化锰加到燃料中，混合均匀之后倒进了实验室 LV-30 的燃料箱里"
                           "Anqur和师妹退回到观察间内"
                           (me-says "三，二，一，点火！")
                           "火焰从 LV-30 的喷口里喷射而出，在后面留下了七个马赫环"
                           (lxz-says "是七个马赫环啊！真没想到能做到这样的成果！")
                           (me-says "就是嘛，师兄的方案你还能不信？")
                           "测试结果出来了，平均比冲达到了惊人的 341s！"
                           (lxz-says "师兄好棒啊！")
                           (me-says "嗯，那差不多写论文吧")
                           (lxz-says "那我先回去咯")
                           (me-says "嗯，剩下的事情我差不多能一个人完成了")
                           "看着师妹的背影，Anqur笑了笑")
                     game-over)
            )))

(play-game anququ-reborn)
